using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Polycardio2
{
    [Flags]
    public enum DeviceStatusFlags : uint
    {
        None = 0,

        // Левая рука (BP1)
        dsBP1_InProgress = 1 << 0,  // Бит 0: Идет измерение АД на левой руке
        dsBP1_OK = 1 << 1,  // Бит 1: Измерение АД на левой руке успешно завершено
        dsBP1_Error = 1 << 2,  // Бит 2: Ошибка измерения АД на левой руке
        dsBP1_Hold = 1 << 3,  // Бит 3: Удержание давления на левой руке (съем сфигмограммы)

        // Левая нога (BP2)
        dsBP2_InProgress = 1 << 4,  // Бит 4: Идет измерение АД на левой ноге
        dsBP2_OK = 1 << 5,  // Бит 5: Измерение АД на левой ноге успешно завершено
        dsBP2_Error = 1 << 6,  // Бит 6: Ошибка измерения АД на левой ноге
        dsBP2_Hold = 1 << 7,  // Бит 7: Удержание давления на левой ноге (съем сфигмограммы)

        // Правая рука (BP3)
        dsBP3_InProgress = 1 << 8,  // Бит 8: Идет измерение АД на правой руке
        dsBP3_OK = 1 << 9,  // Бит 9: Измерение АД на правой руке успешно завершено
        dsBP3_Error = 1 << 10, // Бит 10: Ошибка измерения АД на правой руке
        dsBP3_Hold = 1 << 11, // Бит 11: Удержание давления на правой руке (съем сфигмограммы)

        // Правая нога (BP4)
        dsBP4_InProgress = 1 << 12, // Бит 12: Идет измерение АД на правой ноге
        dsBP4_OK = 1 << 13, // Бит 13: Измерение АД на правой ноге успешно завершено
        dsBP4_Error = 1 << 14, // Бит 14: Ошибка измерения АД на правой ноге
        dsBP4_Hold = 1 << 15, // Бит 15: Удержание давления на правой ноге (съем сфигмограммы)

        // Фотоплетизмограмма
        dsPPG_Error = 1 << 16  // Бит 16: Ошибка фотоплетизмограммы (нет пациента)
    }
}
